#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/kwiniaskaridge/dns/runs/run-oBJ115oqgyKLqnis

Waiting for the plan to start...

Terraform v0.14.7
Configuring remote state backend...
Initializing Terraform configuration...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.kms.aws_kms_key.kms-key will be created
  + resource "aws_kms_key" "kms-key" {
      + arn                      = (known after apply)
      + customer_master_key_spec = "ECC_NIST_P256"
      + deletion_window_in_days  = 7
      + description              = (known after apply)
      + enable_key_rotation      = false
      + id                       = (known after apply)
      + is_enabled               = true
      + key_id                   = (known after apply)
      + key_usage                = "SIGN_VERIFY"
      + policy                   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "kms:DescribeKey",
                          + "kms:GetPublicKey",
                          + "kms:Sign",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "api-service.dnssec.route53.aws.internal"
                        }
                      + Sid       = "Route 53 DNSSEC Permissions"
                    },
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "IAM User Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.zones["com"].aws_route53_hosted_zone_dnssec.zone will be created
  + resource "aws_route53_hosted_zone_dnssec" "zone" {
      + hosted_zone_id = (known after apply)
      + id             = (known after apply)
      + signing_status = "SIGNING"
    }

  # module.zones["com"].aws_route53_key_signing_key.zone will be created
  + resource "aws_route53_key_signing_key" "zone" {
      + digest_algorithm_mnemonic  = (known after apply)
      + digest_algorithm_type      = (known after apply)
      + digest_value               = (known after apply)
      + dnskey_record              = (known after apply)
      + ds_record                  = (known after apply)
      + flag                       = (known after apply)
      + hosted_zone_id             = (known after apply)
      + id                         = (known after apply)
      + key_management_service_arn = (sensitive)
      + key_tag                    = (known after apply)
      + name                       = "kwiniaskaridge.com"
      + public_key                 = (known after apply)
      + signing_algorithm_mnemonic = (known after apply)
      + signing_algorithm_type     = (known after apply)
      + status                     = "ACTIVE"
    }

  # module.zones["com"].aws_route53_zone.zone will be created
  + resource "aws_route53_zone" "zone" {
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "kwiniaskaridge.com"
      + name_servers  = (known after apply)
      + zone_id       = (known after apply)
    }

  # module.zones["net"].aws_route53_hosted_zone_dnssec.zone will be created
  + resource "aws_route53_hosted_zone_dnssec" "zone" {
      + hosted_zone_id = (known after apply)
      + id             = (known after apply)
      + signing_status = "SIGNING"
    }

  # module.zones["net"].aws_route53_key_signing_key.zone will be created
  + resource "aws_route53_key_signing_key" "zone" {
      + digest_algorithm_mnemonic  = (known after apply)
      + digest_algorithm_type      = (known after apply)
      + digest_value               = (known after apply)
      + dnskey_record              = (known after apply)
      + ds_record                  = (known after apply)
      + flag                       = (known after apply)
      + hosted_zone_id             = (known after apply)
      + id                         = (known after apply)
      + key_management_service_arn = (sensitive)
      + key_tag                    = (known after apply)
      + name                       = "kwiniaskaridge.net"
      + public_key                 = (known after apply)
      + signing_algorithm_mnemonic = (known after apply)
      + signing_algorithm_type     = (known after apply)
      + status                     = "ACTIVE"
    }

  # module.zones["net"].aws_route53_zone.zone will be created
  + resource "aws_route53_zone" "zone" {
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "kwiniaskaridge.net"
      + name_servers  = (known after apply)
      + zone_id       = (known after apply)
    }

  # module.zones["org"].aws_route53_hosted_zone_dnssec.zone will be created
  + resource "aws_route53_hosted_zone_dnssec" "zone" {
      + hosted_zone_id = (known after apply)
      + id             = (known after apply)
      + signing_status = "SIGNING"
    }

  # module.zones["org"].aws_route53_key_signing_key.zone will be created
  + resource "aws_route53_key_signing_key" "zone" {
      + digest_algorithm_mnemonic  = (known after apply)
      + digest_algorithm_type      = (known after apply)
      + digest_value               = (known after apply)
      + dnskey_record              = (known after apply)
      + ds_record                  = (known after apply)
      + flag                       = (known after apply)
      + hosted_zone_id             = (known after apply)
      + id                         = (known after apply)
      + key_management_service_arn = (sensitive)
      + key_tag                    = (known after apply)
      + name                       = "kwiniaskaridge.org"
      + public_key                 = (known after apply)
      + signing_algorithm_mnemonic = (known after apply)
      + signing_algorithm_type     = (known after apply)
      + status                     = "ACTIVE"
    }

  # module.zones["org"].aws_route53_zone.zone will be created
  + resource "aws_route53_zone" "zone" {
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "kwiniaskaridge.org"
      + name_servers  = (known after apply)
      + zone_id       = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @randallmorey, Action: `pull_request`*